Masmiseim36/nxpSDK/boards/frdmkv31f/demo_apps/mc_pmsm/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC1 (number 71), J3[15]/FTM0_CH0
  @{ */
#define PINTOOL_FTM_FTM0_CH0_PERIPHERAL FTM0         /*!<@brief Device name: FTM0 */
#define PINTOOL_FTM_FTM0_CH0_SIGNAL CH               /*!<@brief FTM0 signal: CH */
#define PINTOOL_FTM_FTM0_CH0_PORT PORTC              /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH0_PIN 1U                  /*!<@brief PORTC pin index: 1 */
#define PINTOOL_FTM_FTM0_CH0_CHANNEL 0               /*!<@brief FTM0 channel: 0 */
#define PINTOOL_FTM_FTM0_CH0_PIN_NAME FTM0_CH0       /*!<@brief Pin name */
#define PINTOOL_FTM_FTM0_CH0_LABEL "J3[15]/FTM0_CH0" /*!<@brief Label */
#define PINTOOL_FTM_FTM0_CH0_NAME "FTM0_CH0"         /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTC2 (number 72), J3[13]/FTM0_CH1
  @{ */
#define PINTOOL_FTM_FTM0_CH1_PERIPHERAL FTM0         /*!<@brief Device name: FTM0 */
#define PINTOOL_FTM_FTM0_CH1_SIGNAL CH               /*!<@brief FTM0 signal: CH */
#define PINTOOL_FTM_FTM0_CH1_PORT PORTC              /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH1_PIN 2U                  /*!<@brief PORTC pin index: 2 */
#define PINTOOL_FTM_FTM0_CH1_CHANNEL 1               /*!<@brief FTM0 channel: 1 */
#define PINTOOL_FTM_FTM0_CH1_PIN_NAME FTM0_CH1       /*!<@brief Pin name */
#define PINTOOL_FTM_FTM0_CH1_LABEL "J3[13]/FTM0_CH1" /*!<@brief Label */
#define PINTOOL_FTM_FTM0_CH1_NAME "FTM0_CH1"         /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTD4 (number 97), J3[7]/FTM0_CH4
  @{ */
#define PINTOOL_FTM_FTM0_CH4_PERIPHERAL FTM0        /*!<@brief Device name: FTM0 */
#define PINTOOL_FTM_FTM0_CH4_SIGNAL CH              /*!<@brief FTM0 signal: CH */
#define PINTOOL_FTM_FTM0_CH4_PORT PORTD             /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH4_PIN 4U                 /*!<@brief PORTD pin index: 4 */
#define PINTOOL_FTM_FTM0_CH4_CHANNEL 4              /*!<@brief FTM0 channel: 4 */
#define PINTOOL_FTM_FTM0_CH4_PIN_NAME FTM0_CH4      /*!<@brief Pin name */
#define PINTOOL_FTM_FTM0_CH4_LABEL "J3[7]/FTM0_CH4" /*!<@brief Label */
#define PINTOOL_FTM_FTM0_CH4_NAME "FTM0_CH4"        /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTD5 (number 98), J3[5]/FTM0_CH5
  @{ */
#define PINTOOL_FTM_FTM0_CH5_PERIPHERAL FTM0        /*!<@brief Device name: FTM0 */
#define PINTOOL_FTM_FTM0_CH5_SIGNAL CH              /*!<@brief FTM0 signal: CH */
#define PINTOOL_FTM_FTM0_CH5_PORT PORTD             /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH5_PIN 5U                 /*!<@brief PORTD pin index: 5 */
#define PINTOOL_FTM_FTM0_CH5_CHANNEL 5              /*!<@brief FTM0 channel: 5 */
#define PINTOOL_FTM_FTM0_CH5_PIN_NAME FTM0_CH5      /*!<@brief Pin name */
#define PINTOOL_FTM_FTM0_CH5_LABEL "J3[5]/FTM0_CH5" /*!<@brief Label */
#define PINTOOL_FTM_FTM0_CH5_NAME "FTM0_CH5"        /*!<@brief Identifier name */
                                                    /* @} */

/*!
 * @brief 
 *
 */
void PinTool_FTM(void);

/*! @name PORTB16 (number 62), U7[4]/UART0_RX_TGTMCU
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PERIPHERAL UART0              /*!<@brief Device name: UART0 */
#define PINTOOL_UART_DEBUG_UART_RX_SIGNAL RX                     /*!<@brief UART0 signal: RX */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB                    /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U                       /*!<@brief PORTB pin index: 16 */
#define PINTOOL_UART_DEBUG_UART_RX_PIN_NAME UART0_RX             /*!<@brief Pin name */
#define PINTOOL_UART_DEBUG_UART_RX_LABEL "U7[4]/UART0_RX_TGTMCU" /*!<@brief Label */
#define PINTOOL_UART_DEBUG_UART_RX_NAME "DEBUG_UART_RX"          /*!<@brief Identifier name */
                                                                 /* @} */

/*!
 * @brief 
 *
 */
void PinTool_UART(void);

/*! @name PORTD7 (number 100), D4[4]/LEDRGB_GREEN
  @{ */
#define PINTOOL_MISC_LED_GREEN_PERIPHERAL GPIOD           /*!<@brief Device name: GPIOD */
#define PINTOOL_MISC_LED_GREEN_SIGNAL GPIO                /*!<@brief GPIOD signal: GPIO */
#define PINTOOL_MISC_LED_GREEN_GPIO GPIOD                 /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_GREEN_GPIO_PIN 7U                /*!<@brief PORTD pin index: 7 */
#define PINTOOL_MISC_LED_GREEN_PORT PORTD                 /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_GREEN_PIN 7U                     /*!<@brief PORTD pin index: 7 */
#define PINTOOL_MISC_LED_GREEN_CHANNEL 7                  /*!<@brief GPIOD GPIO channel: 7 */
#define PINTOOL_MISC_LED_GREEN_PIN_NAME PTD7              /*!<@brief Pin name */
#define PINTOOL_MISC_LED_GREEN_LABEL "D4[4]/LEDRGB_GREEN" /*!<@brief Label */
#define PINTOOL_MISC_LED_GREEN_NAME "LED_GREEN"           /*!<@brief Identifier name */
                                                          /* @} */

/*! @name PORTD1 (number 94), D4[1]/LEDRGB_RED
  @{ */
#define PINTOOL_MISC_LED_RED_PERIPHERAL GPIOD         /*!<@brief Device name: GPIOD */
#define PINTOOL_MISC_LED_RED_SIGNAL GPIO              /*!<@brief GPIOD signal: GPIO */
#define PINTOOL_MISC_LED_RED_GPIO GPIOD               /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_RED_GPIO_PIN 1U              /*!<@brief PORTD pin index: 1 */
#define PINTOOL_MISC_LED_RED_PORT PORTD               /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_RED_PIN 1U                   /*!<@brief PORTD pin index: 1 */
#define PINTOOL_MISC_LED_RED_CHANNEL 1                /*!<@brief GPIOD GPIO channel: 1 */
#define PINTOOL_MISC_LED_RED_PIN_NAME PTD1            /*!<@brief Pin name */
#define PINTOOL_MISC_LED_RED_LABEL "D4[1]/LEDRGB_RED" /*!<@brief Label */
#define PINTOOL_MISC_LED_RED_NAME "LED_RED"           /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTA4 (number 38), SW2/NMI_b
  @{ */
#define PINTOOL_MISC_SW2_PERIPHERAL GPIOA  /*!<@brief Device name: GPIOA */
#define PINTOOL_MISC_SW2_SIGNAL GPIO       /*!<@brief GPIOA signal: GPIO */
#define PINTOOL_MISC_SW2_GPIO GPIOA        /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW2_GPIO_PIN 4U       /*!<@brief PORTA pin index: 4 */
#define PINTOOL_MISC_SW2_PORT PORTA        /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW2_PIN 4U            /*!<@brief PORTA pin index: 4 */
#define PINTOOL_MISC_SW2_CHANNEL 4         /*!<@brief GPIOA GPIO channel: 4 */
#define PINTOOL_MISC_SW2_PIN_NAME PTA4     /*!<@brief Pin name */
#define PINTOOL_MISC_SW2_LABEL "SW2/NMI_b" /*!<@brief Label */
#define PINTOOL_MISC_SW2_NAME "SW2"        /*!<@brief Identifier name */
                                           /* @} */

/*!
 * @brief 
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
